CSI API ETABS v1
cTower.AllowMultipleTowers Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int AllowMultipleTowers(
	bool AllowMultTowers,
	string RetainedTower = "",
	bool Combine = true
)
Function AllowMultipleTowers (
	AllowMultTowers As Boolean,
	Optional RetainedTower As String = "",
	Optional Combine As Boolean = true
) As Integer
Dim instance As cTower
Dim AllowMultTowers As Boolean
Dim RetainedTower As String
Dim Combine As Boolean
Dim returnValue As Integer
returnValue = instance.AllowMultipleTowers(AllowMultTowers,
	RetainedTower, Combine)
int AllowMultipleTowers(
	bool AllowMultTowers,
	String^ RetainedTower = L"",
	bool Combine = true
)
abstract AllowMultipleTowers :
        AllowMultTowers : bool *
        ?RetainedTower : string *
        ?Combine : bool
(* Defaults:
        let _RetainedTower = defaultArg RetainedTower ""
        let _Combine = defaultArg Combine true
*)
-> int
Parameters
AllowMultTowers
Type: System.Boolean
RetainedTower (Optional)
Type: System.String
Combine (Optional)
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cTower Interface
ETABSv1 Namespace